cassettes/akamai_api_eccu_requests/valid_credentials.yml

---
http_interactions:
- request:
    method: post
    uri: https://USERNAME:PASSWORD@control.akamai.com/webservices/services/PublishECCU
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:akapubeccudt="https://control.akamai.com/2003/Sep/PublishECCU.xsd"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="https://control.akamai.com/AWS.xsd"
        xmlns:ins1="https://control.akamai.com/Publish.xsd"><env:Body><akapubeccudt:getIds></akapubeccudt:getIds></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"getIds"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '457'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache
      Content-Type:
      - text/xml;charset=utf-8
      Content-Length:
      - '2211'
      Expires:
      - Tue, 20 May 2014 15:39:06 GMT
      Cache-Control:
      - max-age=0, no-cache, no-store
      Pragma:
      - no-cache
      Date:
      - Tue, 20 May 2014 15:39:06 GMT
      Connection:
      - keep-alive
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:getIdsResponse
        soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="https://control.akamai.com/2003/Sep/PublishECCU.xsd"><fileIds
        soapenc:arrayType="xsd:int[4]" xsi:type="soapenc:Array" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><fileIds
        xsi:type="xsd:int">112714868</fileIds><fileIds xsi:type="xsd:int">112714869</fileIds><fileIds
        xsi:type="xsd:int">112722029</fileIds><fileIds xsi:type="xsd:int">112899587</fileIds></fileIds></ns1:getIdsResponse></soapenv:Body></soapenv:Envelope>
    http_version:
  recorded_at: Tue, 20 May 2014 15:39:06 GMT
- request:
    method: post
    uri: https://USERNAME:PASSWORD@control.akamai.com/webservices/services/PublishECCU
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:akapubeccudt="https://control.akamai.com/2003/Sep/PublishECCU.xsd"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="https://control.akamai.com/AWS.xsd"
        xmlns:ins1="https://control.akamai.com/Publish.xsd"><env:Body><akapubeccudt:getInfo><fileId
        xsi:type="xsd:int">112714868</fileId><retrieveContents xsi:type="xsd:boolean">false</retrieveContents></akapubeccudt:getInfo></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"getInfo"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '569'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache
      Content-Type:
      - text/xml;charset=utf-8
      Content-Length:
      - '1684'
      Expires:
      - Tue, 20 May 2014 15:39:06 GMT
      Cache-Control:
      - max-age=0, no-cache, no-store
      Pragma:
      - no-cache
      Date:
      - Tue, 20 May 2014 15:39:06 GMT
      Connection:
      - keep-alive
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:getInfoResponse
        soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="https://control.akamai.com/2003/Sep/PublishECCU.xsd"><EccuInfo
        xsi:type="ns2:EccuInfo" xmlns:ns2="https://control.akamai.com/Publish.xsd"><contents
        xsi:type="xsd:base64Binary" xsi:nil="true"/><extendedStatusMessage xsi:type="xsd:string">File
        successfully deployed to Akamai network (Succeeded)</extendedStatusMessage><fileId
        xsi:type="xsd:int">112714868</fileId><fileSize xsi:type="xsd:int">127</fileSize><filename
        xsi:type="xsd:string" xsi:nil="true"/><md5Digest xsi:type="xsd:string">39516c0edc05e85d3b1dfcd6c6058f1c</md5Digest><notes
        xsi:type="xsd:string">ECCU Request using EdgeControl</notes><propertyName
        xsi:type="xsd:string">foo.com</propertyName><propertyNameExactMatch
        xsi:type="xsd:boolean">true</propertyNameExactMatch><propertyType xsi:type="xsd:string">hostheader</propertyType><statusChangeEmail
        xsi:type="xsd:string">guest@mikamai.com</statusChangeEmail><statusCode
        xsi:type="xsd:int">4000</statusCode><statusMessage xsi:type="xsd:string">File
        successfully deployed to Akamai's network</statusMessage><statusUpdateDate
        xsi:type="xsd:dateTime">2014-04-22T16:01:08.790Z</statusUpdateDate><uploadDate
        xsi:type="xsd:dateTime">2014-04-22T15:18:49.790Z</uploadDate><uploadedBy xsi:type="xsd:string">test1</uploadedBy><versionString
        xsi:type="xsd:string" xsi:nil="true"/></EccuInfo></ns1:getInfoResponse></soapenv:Body></soapenv:Envelope>
    http_version:
  recorded_at: Tue, 20 May 2014 15:39:06 GMT
- request:
    method: post
    uri: https://USERNAME:PASSWORD@control.akamai.com/webservices/services/PublishECCU
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:akapubeccudt="https://control.akamai.com/2003/Sep/PublishECCU.xsd"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="https://control.akamai.com/AWS.xsd"
        xmlns:ins1="https://control.akamai.com/Publish.xsd"><env:Body><akapubeccudt:getInfo><fileId
        xsi:type="xsd:int">112714869</fileId><retrieveContents xsi:type="xsd:boolean">false</retrieveContents></akapubeccudt:getInfo></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"getInfo"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '569'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache
      Content-Type:
      - text/xml;charset=utf-8
      Content-Length:
      - '1682'
      Expires:
      - Tue, 20 May 2014 15:39:07 GMT
      Cache-Control:
      - max-age=0, no-cache, no-store
      Pragma:
      - no-cache
      Date:
      - Tue, 20 May 2014 15:39:07 GMT
      Connection:
      - keep-alive
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:getInfoResponse
        soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="https://control.akamai.com/2003/Sep/PublishECCU.xsd"><EccuInfo
        xsi:type="ns2:EccuInfo" xmlns:ns2="https://control.akamai.com/Publish.xsd"><contents
        xsi:type="xsd:base64Binary" xsi:nil="true"/><extendedStatusMessage xsi:type="xsd:string">File
        successfully deployed to Akamai network (Succeeded)</extendedStatusMessage><fileId
        xsi:type="xsd:int">112714869</fileId><fileSize xsi:type="xsd:int">127</fileSize><filename
        xsi:type="xsd:string" xsi:nil="true"/><md5Digest xsi:type="xsd:string">39516c0edc05e85d3b1dfcd6c6058f1c</md5Digest><notes
        xsi:type="xsd:string">ECCU Request using EdgeControl</notes><propertyName
        xsi:type="xsd:string">foo.bar</propertyName><propertyNameExactMatch xsi:type="xsd:boolean">true</propertyNameExactMatch><propertyType
        xsi:type="xsd:string">hostheader</propertyType><statusChangeEmail xsi:type="xsd:string">guest@mikamai.com</statusChangeEmail><statusCode
        xsi:type="xsd:int">4000</statusCode><statusMessage xsi:type="xsd:string">File
        successfully deployed to Akamai's network</statusMessage><statusUpdateDate
        xsi:type="xsd:dateTime">2014-04-22T16:01:08.251Z</statusUpdateDate><uploadDate
        xsi:type="xsd:dateTime">2014-04-22T15:18:49.251Z</uploadDate><uploadedBy xsi:type="xsd:string">test1</uploadedBy><versionString
        xsi:type="xsd:string" xsi:nil="true"/></EccuInfo></ns1:getInfoResponse></soapenv:Body></soapenv:Envelope>
    http_version:
  recorded_at: Tue, 20 May 2014 15:39:07 GMT
- request:
    method: post
    uri: https://USERNAME:PASSWORD@control.akamai.com/webservices/services/PublishECCU
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:akapubeccudt="https://control.akamai.com/2003/Sep/PublishECCU.xsd"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="https://control.akamai.com/AWS.xsd"
        xmlns:ins1="https://control.akamai.com/Publish.xsd"><env:Body><akapubeccudt:getInfo><fileId
        xsi:type="xsd:int">112722029</fileId><retrieveContents xsi:type="xsd:boolean">false</retrieveContents></akapubeccudt:getInfo></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"getInfo"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '569'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache
      Content-Type:
      - text/xml;charset=utf-8
      Content-Length:
      - '1698'
      Expires:
      - Tue, 20 May 2014 15:39:07 GMT
      Cache-Control:
      - max-age=0, no-cache, no-store
      Pragma:
      - no-cache
      Date:
      - Tue, 20 May 2014 15:39:07 GMT
      Connection:
      - keep-alive
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:getInfoResponse
        soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="https://control.akamai.com/2003/Sep/PublishECCU.xsd"><EccuInfo
        xsi:type="ns2:EccuInfo" xmlns:ns2="https://control.akamai.com/Publish.xsd"><contents
        xsi:type="xsd:base64Binary" xsi:nil="true"/><extendedStatusMessage xsi:type="xsd:string">File
        successfully deployed to Akamai network (Succeeded)</extendedStatusMessage><fileId
        xsi:type="xsd:int">112722029</fileId><fileSize xsi:type="xsd:int">140</fileSize><filename
        xsi:type="xsd:string" xsi:nil="true"/><md5Digest xsi:type="xsd:string">a4ae326fc3ea4094562033e8378a76df</md5Digest><notes
        xsi:type="xsd:string">ECCU Request using EdgeControl</notes><propertyName
        xsi:type="xsd:string">foo.com</propertyName><propertyNameExactMatch
        xsi:type="xsd:boolean">true</propertyNameExactMatch><propertyType xsi:type="xsd:string">hostheader</propertyType><statusChangeEmail
        xsi:type="xsd:string">guest@mikamai.com</statusChangeEmail><statusCode
        xsi:type="xsd:int">4000</statusCode><statusMessage xsi:type="xsd:string">File
        successfully deployed to Akamai's network</statusMessage><statusUpdateDate
        xsi:type="xsd:dateTime">2014-04-22T17:29:00.809Z</statusUpdateDate><uploadDate
        xsi:type="xsd:dateTime">2014-04-22T16:53:11.809Z</uploadDate><uploadedBy xsi:type="xsd:string">guest@mikamai.com</uploadedBy><versionString
        xsi:type="xsd:string" xsi:nil="true"/></EccuInfo></ns1:getInfoResponse></soapenv:Body></soapenv:Envelope>
    http_version:
  recorded_at: Tue, 20 May 2014 15:39:07 GMT
- request:
    method: post
    uri: https://USERNAME:PASSWORD@control.akamai.com/webservices/services/PublishECCU
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:akapubeccudt="https://control.akamai.com/2003/Sep/PublishECCU.xsd"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="https://control.akamai.com/AWS.xsd"
        xmlns:ins1="https://control.akamai.com/Publish.xsd"><env:Body><akapubeccudt:getInfo><fileId
        xsi:type="xsd:int">112899587</fileId><retrieveContents xsi:type="xsd:boolean">false</retrieveContents></akapubeccudt:getInfo></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"getInfo"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '569'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache
      Content-Type:
      - text/xml;charset=utf-8
      Content-Length:
      - '1696'
      Expires:
      - Tue, 20 May 2014 15:39:08 GMT
      Cache-Control:
      - max-age=0, no-cache, no-store
      Pragma:
      - no-cache
      Date:
      - Tue, 20 May 2014 15:39:08 GMT
      Connection:
      - keep-alive
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:getInfoResponse
        soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="https://control.akamai.com/2003/Sep/PublishECCU.xsd"><EccuInfo
        xsi:type="ns2:EccuInfo" xmlns:ns2="https://control.akamai.com/Publish.xsd"><contents
        xsi:type="xsd:base64Binary" xsi:nil="true"/><extendedStatusMessage xsi:type="xsd:string">File
        successfully deployed to Akamai network (Succeeded)</extendedStatusMessage><fileId
        xsi:type="xsd:int">112899587</fileId><fileSize xsi:type="xsd:int">216</fileSize><filename
        xsi:type="xsd:string" xsi:nil="true"/><md5Digest xsi:type="xsd:string">e5128c2a649653576d2fa7af71014eef</md5Digest><notes
        xsi:type="xsd:string">ECCU Request using EdgeControl</notes><propertyName
        xsi:type="xsd:string">foo.com</propertyName><propertyNameExactMatch
        xsi:type="xsd:boolean">true</propertyNameExactMatch><propertyType xsi:type="xsd:string">hostheader</propertyType><statusChangeEmail
        xsi:type="xsd:string">guest@mikamai.com</statusChangeEmail><statusCode
        xsi:type="xsd:int">4000</statusCode><statusMessage xsi:type="xsd:string">File
        successfully deployed to Akamai's network</statusMessage><statusUpdateDate
        xsi:type="xsd:dateTime">2014-04-23T11:23:50.239Z</statusUpdateDate><uploadDate
        xsi:type="xsd:dateTime">2014-04-23T10:58:41.239Z</uploadDate><uploadedBy xsi:type="xsd:string">guest@mikamai.com</uploadedBy><versionString
        xsi:type="xsd:string" xsi:nil="true"/></EccuInfo></ns1:getInfoResponse></soapenv:Body></soapenv:Envelope>
    http_version:
  recorded_at: Tue, 20 May 2014 15:39:21 GMT
recorded_with: VCR 2.9.0
